apply_library_patches: true
bundled_packages_dir: packages
data_dir: data
description: null
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: pytorch
model_metadata:
  model_binary_dir: model
  torch_model_package_name: torch_model
  torch_model_pickle_filename: model.pkl
  torch_package_file: model_package.pt
model_module_dir: model
model_name: null
model_type: Model
python_version: py39
requirements:
- torchvision==0.15.2
- torch==2.0.1
- slashml==0.1.5
resources:
  accelerator: null
  cpu: 500m
  memory: 512Mi
  use_gpu: false
secrets: {}
spec_version: '2.0'
system_packages: []
train:
  resources:
    accelerator: null
    cpu: 500m
    memory: 512Mi
    use_gpu: false
  training_class_filename: train.py
  training_class_name: Train
  training_module_dir: train
  variables: {}
